START_TEXT = """🌟 ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ ᴛʜᴇ ᴍᴏᴠɪᴇ ᴄᴀᴘᴛɪᴏɴ ʙᴏᴛ! 🎬

ɪ ᴄᴀɴ ʜᴇʟᴘ ʏᴏᴜ ᴄʀᴇᴀᴛᴇ ʙᴇᴀᴜᴛɪғᴜʟ ᴄᴀᴘᴛɪᴏɴs ғᴏʀ ᴍᴏᴠɪᴇs ᴀɴᴅ sᴇʀɪᴇs, ᴀʟᴏɴɢ ᴡɪᴛʜ ғᴇᴛᴄʜɪɴɢ ᴘᴏsᴛᴇʀs ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ. 
Sᴛᴀʀᴛ ᴇxᴘʟᴏʀɪɴɢ ɴᴏᴡ! 🚀"""

ABOUT_TEXT = """
🤖 ᴄᴀᴘᴛɪᴏɴ ᴍᴀᴋᴇʀ ʙᴏᴛ
📜 ɪɴғᴏʀᴍᴀᴛɪᴏɴ:
├ ɴᴀᴍᴇ: ᴛɪᴇʀ ʜᴀʀʀɪʙᴇʟ
├ ʀᴀɴᴋ: ᴇsᴘᴀᴅᴀ ɴᴏ. 3 🏆
├ ʟᴀɴɢᴜᴀɢᴇ: <a href=https://www.python.org>ᴘʏᴛʜᴏɴ</a>
├ ʟɪʙʀᴀʀʏ: <a href=https://docs.pyrogram.org>ᴘʏʀᴏɢʀᴀᴍ</a>
└ ᴄʀᴇᴀᴛᴏʀ: <a href=https://t.me/mithun_naam_toh_suna_hoga>ᴍɪᴛʜᴜɴ</a>

🛠️ _ᴇғғᴏʀᴛʟᴇssʟʏ ᴄʀᴀғᴛ ʏᴏᴜʀ ᴍᴏᴠɪᴇ ᴄᴀᴘᴛɪᴏɴs!_
"""

HELP_TEXT = f"""
🔍 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:

✨ ʙᴏᴛ ᴄᴏɴᴛʀᴏʟ:
• `/start` - Sᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ 🚀

🎥 ᴍᴏᴠɪᴇ ғᴇᴀᴛᴜʀᴇs:
• `/captionM` ᴏʀ `/cm` [ᴍᴏᴠɪᴇ ɴᴀᴍᴇ] - Fᴇᴛᴄʜ ᴍᴏᴠɪᴇ ᴘᴏsᴛᴇʀ ᴡɪᴛʜ ᴄᴀᴘᴛɪᴏɴ 🖼️
• `/captionS` ᴏʀ `/cs` [sᴇʀɪᴇs ɴᴀᴍᴇ] - Fᴇᴛᴄʜ sᴇʀɪᴇs ᴘᴏsᴛᴇʀ ᴡɪᴛʜ ᴄᴀᴘᴛɪᴏɴ 📺

📈 ᴛʀᴇɴᴅɪɴɢ & ᴘᴏᴘᴜʟᴀʀ:
• `/trending` ᴏʀ `/tr` - Gᴇᴛ ᴛʀᴇɴᴅɪɴɢ ᴍᴏᴠɪᴇs/ᴛᴠ 🔥
• `/popular` ᴏʀ `/pp` - Fᴇᴛᴄʜ ᴘᴏᴘᴜʟᴀʀ ᴍᴏᴠɪᴇs 📊
• `/upcoming` ᴏʀ `/up` - Sᴇᴇ ᴜᴘᴄᴏᴍɪɴɢ ᴍᴏᴠɪᴇs 🎬

💡 ʜᴏᴡ ᴛᴏ ᴜsᴇ:
1️⃣ Sᴇɴᴅ ᴛʜᴇ ʀᴇʟᴇᴠᴀɴᴛ ᴄᴏᴍᴍᴀɴᴅ ᴡɪᴛʜ ᴛʜᴇ ʀᴇǫᴜɪʀᴇᴅ ɴᴀᴍᴇ.  
2️⃣ Wᴀɪᴛ ғᴏʀ ᴛʜᴇ ʙᴏᴛ ᴛᴏ ғᴇᴛᴄʜ ᴅᴇᴛᴀɪʟs.  
3️⃣ Eɴᴏʏ ʏᴏᴜʀ ʙᴇᴀᴜᴛɪғᴜʟʟʏ ᴄʀᴀғᴛᴇᴅ ᴄᴀᴘᴛɪᴏɴ! ✨
"""

SUPPORT_TEXT = """
📢 sᴛᴀʏ ᴜᴘᴅᴀᴛᴇᴅ!

Jᴏɪɴ ᴏᴜʀ ᴄʜᴀɴɴᴇʟs ғᴏʀ ᴛʜᴇ ʟᴀᴛᴇsᴛ ᴜᴘᴅᴀᴛᴇs ᴀɴᴅ sᴜᴘᴘᴏʀᴛ:
├ ᴍᴀɪɴ ᴄʜᴀɴɴᴇʟ:  <a href=https://t.me/espada_org>ᴇsᴘᴀᴅᴀ.ᴏʀɢ</a>
├ sᴜᴘᴘᴏʀᴛ ᴄʜᴀɴɴᴇʟ: <a href=https://t.me/espadaSupport>ᴇsᴘᴀᴅᴀ.ᴏʀɢ sᴜᴘᴘᴏʀᴛ</a>

❓ Nᴇᴇᴅ ʜᴇʟᴘ? Fᴇᴇʟ ғʀᴇᴇ ᴛᴏ ᴀsᴋ ɪɴ ᴏᴜʀ sᴜᴘᴘᴏʀᴛ ɢʳᴏᴜᴘ!
"""

MOVIE_TEXT = """
🎥 ᴀᴄᴄᴇss ᴍᴏᴠɪᴇs & ᴀɴɪᴍᴇ:
├ ᴍᴏᴠɪᴇ's ᴄʜᴀɴɴᴇʟ:  <a href="https://t.me/PirecyKings2">ᴘɪʀᴇᴄʏ ᴋɪɴɢs𝟸</a>  
├ ᴀɴɪᴍᴇ's ᴄʜᴀɴɴᴇʟ: <a href="https://t.me/Animeke14hai">ᴀɴɪᴍᴇ ᴋᴇ 𝟷𝟺</a>  
├ ᴍᴏᴠɪᴇ's ɢʀᴏᴜᴘ: <a href="https://t.me/pirecykingstalks">ᴘɪʀᴇᴄʏ ᴋɪɴɢs𝟸 ᴛᴀʟᴋ</a>  
└ ᴀɴɪᴍᴇ's ɢʀᴏᴜᴘ: <a href="https://t.me/anime14talks">ᴀɴɪᴍᴇ ᴋᴇ 𝟷𝟺 ᴛᴀʟᴋ</a>

🛠️ _sᴛᴀʏ ᴇɴᴛᴇʀᴛᴀɪɴᴇᴅ ᴡɪᴛʜ ᴛʜᴇ ʟᴀᴛᴇsᴛ ᴍᴏᴠɪᴇs ᴀɴᴅ ᴀɴɪᴍᴇ ᴄᴏʟʟᴇᴄᴛɪᴏɴs!_
"""